app/Controllers/Desa.php

SELECT *
FROM `desa`
WHERE `desa`.`id_desa` = '1'
SELECT *
FROM `user`
WHERE `id_desa` = '1'
AND `role` = 3
---
    public function data_warga()
    {
        $id_desa = session()->get('id_desa');
        $desa = $this->Modeldesa->find($id_desa);
        $warga = $this->Modeluser
            ->where('id_desa', $id_desa)
            ->where('role', 3)
            ->findAll();