app/Models/Modelauth.php

    public function login($email, $password)
    {
        // Query untuk mencari user berdasarkan email
        return $this->db->table('user')
            ->select('user.*, jabatan.jabatan as role') // Ambil nama jabatan sebagai role
            ->join('jabatan', 'jabatan.id = user.role', 'left') // Join tabel jabatan
            ->where('email', $email) // Pencarian berdasarkan email
            ->where('password', $password) // Bandingkan password secara langsung
            ->get()->getRowArray();
---
SELECT `user`.*, `jabatan`.`jabatan` as `role`
FROM `user`
LEFT JOIN `jabatan` ON `jabatan`.`id` = `user`.`role`
WHERE `email` = 'aqila@gmail.com'
AND `password` = '1234'