app/Models/Modelberita.php

    public function getAllBerita($id_user)
    {
        return $this->where('id_user', $id_user)
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `berita`
WHERE `id_user` = '8'
ORDER BY `created_at` DESC