app/Models/Modelpermohonan.php

SELECT `permohonan_surat`.*, `user`.`nama_user`, `jenis_surat`.`surat`, `status_surat`.`status`, `desa`.`nama_desa`
FROM `permohonan_surat`
LEFT JOIN `user` ON `user`.`id_user` = `permohonan_surat`.`id_user`
LEFT JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
LEFT JOIN `status_surat` ON `status_surat`.`id_status` = `permohonan_surat`.`id_status`
LEFT JOIN `desa` ON `desa`.`id_desa` = `user`.`id_desa`
WHERE `user`.`id_desa` = '1'
ORDER BY `permohonan_surat`.`created_at` DESC
---
    public function getAllPermohonan()
    {
        return $this->db->table($this->table)
            ->select('permohonan_surat.*, user.nama_user, user.id_desa, jenis_surat.surat, status_surat.status, desa.nama_desa')
            ->join('user', 'user.id_user = permohonan_surat.id_user', 'left')
            ->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis', 'left')
            ->join('status_surat', 'status_surat.id_status = permohonan_surat.id_status', 'left')
            ->join('desa', 'desa.id_desa = user.id_desa', 'left')
            ->whereIn('status_surat.status', ['Diverifikasi Pihak Desa', 'Selesai'])
            ->orderBy('permohonan_surat.created_at', 'DESC')
            ->get()->getResultArray();

SELECT `jenis_surat`.`surat` as `jenis_surat`, COUNT(*) as total
FROM `permohonan_surat`
JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
GROUP BY `permohonan_surat`.`id_jenis`
---
    public function getLaporan($tahun, $bulan)
    {
        $builder = $this->db->table('permohonan_surat');
        $builder->select('jenis_surat.surat as jenis_surat, COUNT(*) as total');
        $builder->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis');

        if ($tahun) {
            $builder->where('YEAR(permohonan_surat.created_at)', $tahun);
        }

        if ($bulan) {
            $builder->where('MONTH(permohonan_surat.created_at)', $bulan);
        }

        $builder->groupBy('permohonan_surat.id_jenis');

        return $builder->get()->getResultArray();

SELECT `jenis_surat`.`surat`, COUNT(*) as total
FROM `permohonan_surat`
JOIN `user` ON `user`.`id_user` = `permohonan_surat`.`id_user`
JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
WHERE `user`.`id_desa` = '1'
GROUP BY `permohonan_surat`.`id_jenis`
---
    public function getPermohonanByDesa($id_desa, $id_status = null)
    {
        $builder = $this->db->table($this->table)
            ->select('permohonan_surat.*, user.nama_user, jenis_surat.surat, status_surat.status, desa.nama_desa')
            ->join('user', 'user.id_user = permohonan_surat.id_user', 'left')
            ->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis', 'left')
            ->join('status_surat', 'status_surat.id_status = permohonan_surat.id_status', 'left')
            ->join('desa', 'desa.id_desa = user.id_desa', 'left')
            ->where('user.id_desa', $id_desa);

SELECT `permohonan_surat`.*, `user`.`nama_user`, `user`.`nik`, `user`.`id_desa`, `jenis_surat`.`surat`, `status_surat`.`status`
FROM `permohonan_surat`
LEFT JOIN `user` ON `user`.`id_user` = `permohonan_surat`.`id_user`
LEFT JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
LEFT JOIN `status_surat` ON `status_surat`.`id_status` = `permohonan_surat`.`id_status`
WHERE `permohonan_surat`.`id_user` = '4'
ORDER BY `permohonan_surat`.`created_at` DESC
---
    public function getPermohonanByUser($id_user)
    {
        return $this->db->table($this->table)
            ->select('permohonan_surat.*, user.nama_user,user.nik, user.id_desa, jenis_surat.surat, status_surat.status')
            ->join('user', 'user.id_user = permohonan_surat.id_user', 'left')
            ->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis', 'left')
            ->join('status_surat', 'status_surat.id_status = permohonan_surat.id_status', 'left')
            ->where('permohonan_surat.id_user', $id_user)
            ->orderBy('permohonan_surat.created_at', 'DESC')
            ->get()->getResultArray();

SELECT `permohonan_surat`.*, `user`.`nama_user`, `user`.`nik`, `user`.`kelamin`, `user`.`agama`, `user`.`email`, `user`.`pekerjaan`, `user`.`alamat`, `user`.`tempat_lahir`, `user`.`tgl_lahir`, `jenis_surat`.`surat`, `status_surat`.`status`, `desa`.`nama_desa`
FROM `permohonan_surat`
LEFT JOIN `user` ON `user`.`id_user` = `permohonan_surat`.`id_user`
LEFT JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
LEFT JOIN `status_surat` ON `status_surat`.`id_status` = `permohonan_surat`.`id_status`
LEFT JOIN `desa` ON `desa`.`id_desa` = `user`.`id_desa`
WHERE `permohonan_surat`.`id_permohonan` = '34'
---
    public function getPermohonanById($id_permohonan)
    {
        return $this->db->table($this->table)
            ->select('permohonan_surat.*, user.nama_user,user.nik,user.kelamin,user.agama, user.email,user.pekerjaan,user.alamat,user.tempat_lahir,user.tgl_lahir, jenis_surat.surat, status_surat.status, desa.nama_desa')
            ->join('user', 'user.id_user = permohonan_surat.id_user', 'left')
            ->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis', 'left')
            ->join('status_surat', 'status_surat.id_status = permohonan_surat.id_status', 'left')
            ->join('desa', 'desa.id_desa = user.id_desa', 'left')
            ->where('permohonan_surat.id_permohonan', $id_permohonan)
            ->get()->getRowArray();

SELECT `jenis_surat`.`surat`, COUNT(*) as total
FROM `permohonan_surat`
JOIN `user` ON `user`.`id_user` = `permohonan_surat`.`id_user`
JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
WHERE `user`.`id_desa` = '14'
GROUP BY `permohonan_surat`.`id_jenis`
---
    public function getJumlahJenisSuratByDesa($id_desa)
    {
        return $this->db->table($this->table)
            ->select('jenis_surat.surat, COUNT(*) as total')
            ->join('user', 'user.id_user = permohonan_surat.id_user')
            ->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis')
            ->where('user.id_desa', $id_desa)
            ->groupBy('permohonan_surat.id_jenis')
            ->get()->getResultArray();

SELECT MAX(`nomor_surat`) AS `last`
FROM `permohonan_surat`
WHERE `nomor_surat` LIKE '%/2025' ESCAPE '!'
---
    public function generateNomorSuratCamat($idJenis)
    {
        // Ambil tahun sekarang
        $tahun = date('Y');

        // Cari nomor terakhir di tahun ini
        $builder = $this->db->table('permohonan_surat');
        $builder->selectMax('nomor_surat', 'last');
        $builder->like('nomor_surat', "/$tahun", 'before'); // cari yang sesuai tahun
        $query = $builder->get()->getRowArray();