app/Models/Modeljenissurat.php

    public function getAllJenisSurat()
    {
        return $this->db->table('jenis_surat')
            ->select('*')
            ->orderBy('surat', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `jenis_surat`
ORDER BY `surat` ASC