app/Models/Modeluser.php

SELECT *
FROM `user`
WHERE `id_user` = '8'
 LIMIT 1
---
    public function getUser($id)
    {
        return $this->where('id_user', $id)->first();

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = '2'
---
    public function countAdminDesa()
    {
        return $this->where('role', '2')->countAllResults();