app/Models/Modeldesa.php

    public function getAllDesa()
    {
        return $this->db->table('desa')
            ->select('*')
            ->orderBy('nama_desa', 'ASC')
            ->get()->getResultArray();
---
SELECT *
FROM `desa`
ORDER BY `nama_desa` ASC

    public function getDesaById($id_desa)
    {
        return $this->where('id_desa', $id_desa)->first();
---
SELECT *
FROM `desa`
WHERE `id_desa` = '14'
 LIMIT 1

    public function get_admin_desa()
    {
        return $this->db->table('user')
            ->select('user.id_user, user.nama_user, user.email, desa.nama_desa')
            ->join('desa', 'desa.id_desa = user.id_desa', 'left')
            ->where('user.role', 2)
            ->orderBy('desa.id_desa', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `user`.`id_user`, `user`.`nama_user`, `user`.`email`, `desa`.`nama_desa`
FROM `user`
LEFT JOIN `desa` ON `desa`.`id_desa` = `user`.`id_desa`
WHERE `user`.`role` = 2
ORDER BY `desa`.`id_desa` ASC