app/Models/Modelpermohonan.php

SELECT `permohonan_surat`.*, `user`.`nama_user`, `user`.`email`, `jenis_surat`.`surat`, `status_surat`.`status`, `desa`.`nama_desa`
FROM `permohonan_surat`
LEFT JOIN `user` ON `user`.`id_user` = `permohonan_surat`.`id_user`
LEFT JOIN `jenis_surat` ON `jenis_surat`.`id_jenis` = `permohonan_surat`.`id_jenis`
LEFT JOIN `status_surat` ON `status_surat`.`id_status` = `permohonan_surat`.`id_status`
LEFT JOIN `desa` ON `desa`.`id_desa` = `user`.`id_desa`
WHERE `permohonan_surat`.`id_permohonan` = '28'
---
    public function getPermohonanById($id_permohonan)
    {
        return $this->db->table($this->table)
            ->select('permohonan_surat.*, user.nama_user, user.email, jenis_surat.surat, status_surat.status, desa.nama_desa')
            ->join('user', 'user.id_user = permohonan_surat.id_user', 'left')
            ->join('jenis_surat', 'jenis_surat.id_jenis = permohonan_surat.id_jenis', 'left')
            ->join('status_surat', 'status_surat.id_status = permohonan_surat.id_status', 'left')
            ->join('desa', 'desa.id_desa = user.id_desa', 'left')
            ->where('permohonan_surat.id_permohonan', $id_permohonan)
            ->get()->getRowArray();